[{"review_id": "2a84d4c2-4962-4437-872d-e8f8c7728a2c", "text": "Wonderful lip balm. Creamy, not waxy and stayed put. Smells luscious and sweet. I feel like this hydrates for at least an hour too. No stinging upon application. The lids audibly \"clicks\" when closed so you know it shut. 45 spf too.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61jRcki1fCL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "49588cbb-c703-427a-89aa-c9c22aba87b1", "text": "I paid $24.99 for the 4 cavity 3 way lipstick mold and a few days later it jumped to $59, possibly different sellers I don't know, but it was good timing on my part.<br />Considering I have read we might consume more than 2 pounds of unhealthy lipsticks per lifetime it might have been worth the higher $59 price to be able to use any recipe for lipstick or chapstick I want, when I want it, not to mention any color in the world.<br />After finding and deciding to purchase this mold a few days later I purchased lipstck tubes, tiny measuring spoons and spatulas, the best butters from across the world (thank you Amazon), oxides and pigments from Amazon.<br />Because the orders arrived so quickly and wrapped so securely, it didn't give me much time to research lipstick and color recipes to tweak and make my own, so I haven't yet opened my new mold. I continued to search and learn about high gloss, matt's, waterproof and plumping, supple and antiaging recipes and I am now ready to give this a try.<br />It all looks pretty basic, even cleaning the mold.<br />Right now I have my favorite (not necessarily healthy) Chapstick in every room, all vehicles, and in my purse for constant dry, hot, freezing, desert weather protection and I can't wait to replace them with my own tints, and colored lipsticks.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81ykEYOPRnL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "f640dfd7-0384-447e-89b1-9844e901d56f", "text": "I spend 99% of my life with chapped lips, so I’m always looking for a chapstick or lip balm that will actually work.<br /><br />I was intrigued by the hemp oil in the Pharmacopia Tangerine-Flavored Lip Balm. But not all of the ingredients are listed in the product information. I am allergic to beeswax, which is the second ingredient in the lip balm. So I was unable to use it.<br /><br />I’m including a picture of the tube, but for reference, here are the ingredients: helianthus annuus (sunflower) oil, beeswax/cire d’abeille, olea europaea (extra virgin olive) oil, aroma (flavor), cannabis sativa (hemp) seed oil, rosmarinus officinalis (rosemary) leaf extract, tocopherol (vitamin E), aloe barbadensis.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/41s0rS6TOeL._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "3e9d545e-fa73-4677-a7ab-6160cae5ea08", "text": "This lip balms smells awesome. It also did a nice job of moisturizing my lips while it was on. I do feel like after it was gone, my lips seemed a little dryer. The color had a very slight tint of pink and it had my lips glossed but not overly glossed.", "image_url": "https://m.media-amazon.com/images/I/51dXJoa4ODL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "e8800689-e0ad-44d7-8076-9487bfb7d84f", "text": "Since I am getting back into a more of an organic lifestyle, using more things organic for my skin as well, I figured I would try my hand at making some lip balms. I was able to get these at a discounted sale price and quite pleased with them. I got the blue colored ones. You get 12 of them in a nice tidy box. The caps snap on easily but do not pop off-they stay on! They twist up nicely too. They seem to made very good-way better than some solid white ones I bought at my local craft store. When I used those, the warm/hot mix seemed to make them feel flimsy. These right off the bat are a thicker feel. Plus I think they will look much nicer. The translucent body will show off my balm! They are a standard 5.5mL size like most lip balms sold commercially. Like I said I am very pleased with my purchase!<br />Even though I got these at a discounted price, I am under NO obligation to leave a review. I am leaving my review based on my honest opinion of the product. Once I use these up, I will get more. For 12 of these, the price is cheaper than the ones I got at my local big name craft store!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51gXNlmnZFL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "d8b358c5-d347-4139-b5bb-f55f679f0f8e", "text": "Since I am getting back into a more of an organic lifestyle, using more things organic for my skin as well, I figured I would try my hand at making some lip balms. I was able to get these at a discounted sale price and quite pleased with them. I got the blue colored ones. You get 12 of them in a nice tidy box. The caps snap on easily but do not pop off-they stay on! They twist up nicely too. They seem to made very good-way better than some solid white ones I bought at my local craft store. When I used those, the warm/hot mix seemed to make them feel flimsy. These right off the bat are a thicker feel. Plus I think they will look much nicer. The translucent body will show off my balm! They are a standard 5.5mL size like most lip balms sold commercially. Like I said I am very pleased with my purchase!<br />Even though I got these at a discounted price, I am under NO obligation to leave a review. I am leaving my review based on my honest opinion of the product. Once I use these up, I will get more. For 12 of these, the price is cheaper than the ones I got at my local big name craft store!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51gXNlmnZFL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "ea09b4bb-72d4-4210-bd75-c45e93ed5c6c", "text": "One of the chapsticks was completely empty. Not even melted inside. Just completely empty. Only thin layer of chapstick on the bottom.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/614ZAf4pFZL.jpg", "sentiment": "negative"}, {"review_id": "e57e93ad-57a9-4b32-adc4-a5c2965d1c82", "text": "First up, I read most of the bad reviews and I still bought this product. Secondly, I am glad I took that gamble. Why? I really love it.<br /><br />If you are a multi faceted minded person like me, you will realize multiple uses for this amazing product quickly . This can triple as a base coat for lipstick/ lipgloss 💄 ,top coat and just moisturizing agent. It’s great!<br /><br />Downside is, 2/4 of the balms smell kinda funny. However, I look for effectiveness and efficacy of a product. Who cares if 2/4 smells bad. I would totally buy again if I ever ran out .", "image_url": "https://images-na.ssl-images-amazon.com/images/I/A1IG6JXn-hL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "8e879ead-7b8a-4245-9e59-2a8acdf8d09e", "text": "I got this because all 11 ingredients are things I recognize & are all \"natural\". The first ingredient is propolis and the honey is fourth. That's what is shown in the product photo. However, the ingredients are in a different order on the actual product. Still good, but not what I expected. (see my screenshot.)<br /><br />It's a tiny tube (see compared to a regular toothpick) and the actual stick of product is not very long.<br /><br />Overall, this is better than the usual basic lip balm I grab at the stores. It's kind of pricy for a lip product but I think that the ingredients are worth it & do make my lips feel more moisturized than they usually are.<br /><br />I side-eyed the price at first but then I look at the ingredients - even as shown on the package I got -  and realize it's worth it.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51IwZydb76L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "baecf8c0-bb34-457b-aa0f-10ae17351909", "text": "Love this balm! Great look to the case, small enough for an evening clutch and gives a great pop of color!!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71tG1Jnf9ML.jpg", "sentiment": "positive"}, {"review_id": "fe98286b-8635-4e98-81bc-7296f1df3803", "text": "Simple and easy order. Did not have any problems with this order at all. I love the tubes. I do recommend to use gloves when packing this item because finger prints can show up on the tinted plastic. Just wipe it off to avoid selling something that looks tacky and we don’t want tacky finger prints :)", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61I7zScpTRL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "97f425e7-c4d2-408a-95bc-5c7bac4c5c99", "text": "My lips get dry during the winter and I need lip balm that is moisturizing. While I use lip balm with sunscreen while outside, I don't like to use lip balm with sunscreen any other time as it usually tastes weird. This lip balm is amazing. It's not too waxy and it doesn't have the odd tastes of those with added sunscreen. In fact, the tangerine flavor is subtle and nice.<br /><br />I love that the ingredients are 100% natural and 65% organic. I normally wouldn't spend  more than $5.00 on a tube of lip balm but this is worth it. It's a bigger diameter than the average lip balm size. Plus, the moisturizing ingredients make this a keeper. Glad I got a chance to review this as it's a great discovery.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/619N1ml1K8L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "f6d2c6af-2e81-43dd-af5d-21aebe82a811", "text": "I like this lip balm it smells wonderful. Like peaches so good i feel like eating it Jaja. I like the cute packaging is cute with peaches. It has a little bit of color is more like a nude color. On my lips it would probably look different on another person.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81GrxenHg-L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "cb5ddc2e-5f05-420a-8ec8-578ea9c6405c", "text": "The glimmer balm in gold is pretty and subtle. The color change is a nice pink hue and not a super hot 90s pink like other brands. It also stains your lips, which was what I hoped for because I didn’t want my face masks stained with lipstick. I love this as it’s moisturizing and the color is long lasting.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71QaTq2OYkL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "85c7df68-94ee-4fff-ac10-358f48eeaa13", "text": "Love this! Smells subtle but sweet and wonderful like vanilla and the whole thing is akin to the size of an eos chapstick. Feels perfect and smooth but not waxy when applied. Has no taste, but it's really not meant to be eaten. So cute!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91Bfh3fTJ7L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "c35d7d7d-c38f-4e15-8046-1cdadc3607b3", "text": "I can't believe there are good reviews for this product. There are hard chunks of undissolved ingredients in every stick I opened. It is very hard / rough on your lips and does not moisturize. I tried using it more hoping it would improve, but it does not. When these chunks finally break apart from the stick it just solid crap on your lips and you have to blow it off.<br /><br />See the photos I attached. It is like the lip balm is just a bunch of hard chunky material.<br /><br />Smells like it should, but was not made correctly and does not work.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/615EcRmeo5L.jpg", "sentiment": "negative"}, {"review_id": "3c104e3d-264a-4a51-8394-37cf879ccc3a", "text": "I love this color and wanted to try this in a smaller version to see if I would like it before buying it in the larger more expensive size. I rarely use lip balms or blushes but I have noticed a nice pinky hue to natural look makes a big difference. They are both super cute and sheer enough to see your skin through it but still pigmented enough that you are not using a ton of it each time. I will say the benefit of buying the smaller one is the travel size, but it is harder to get a full swipe on the brush to use in one pass. You have to kin of pack it on there a little more to get the desired look. Overall this color combo is fantastic. I would recommend trying it.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/B1WN7onfd5S._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "2a73e38e-7490-4bc9-8050-b0a1e7e51adf", "text": "These little jars are amazing for my lip gloss & lip scrub samples for my site! Keep in mind they’re pretty small, but if you’re using them for samples they’re the PERFECT size! I’ll be back for more I love the cute heart shape!<br /><br />Follow my page on instagram @vitamincibeauty", "image_url": "https://m.media-amazon.com/images/I/61zIZ-0szXL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "405de387-15bc-49d4-8e5b-0a8acaa08b15", "text": "This is a nice lip balm. It’s smooth and creamy. It’s sheer and lightweight. It’s moisturizing. It has a pleasant scent. It doesn’t taste fruity to me. I don’t taste guava. It tastes more like a floral flavor, almost like I’m eating flowers. I wish it tasted more fruity. I like that it is vegan and cruelty free.", "image_url": "https://m.media-amazon.com/images/I/619Znh-erhL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "e8b71e4a-c76c-446d-87ea-e3f8ca2487f5", "text": "Really good lip stick (clear) more like chap stick there okay the pot Of miracle works better for me even though there from the same brand the only difference between the two is you don't have to stick your finger in the little container to put it on", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61ZhBfP6vsL.jpg", "sentiment": "positive"}, {"review_id": "42e652df-3f51-4e4f-b2ab-6c777a0dabc7", "text": "This is by far the best lip balm I've ever used! I agree, it's pricey, and you may be hesitant on spending this much on lip balm. I assure you, it's well worth the price.<br />I originally received this product in one of those monthly makeup subscription boxes and fell in love after the first use. This product is not easy to find so I was very excited when I saw it here on Amazon.<br />It's not greasey, is long-lasting, and keeps your lips soft!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/A1HpXNGOj7L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "b106a05a-079a-494d-a88b-0187876c8186", "text": "Tube are big I order 8ml.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/B1EMRlLnVcS._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "08d6f2f5-b6d9-43c0-a638-ebf5610513d9", "text": "I used this product to make baby shower favors for gender unknown.  Perfect shade of mint and smells oh, so good.", "image_url": "https://m.media-amazon.com/images/I/61rvq07WfkL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "15a09d0c-10d9-450a-aa2c-496a97ef3b48", "text": "This is a beautiful clearish lipgloss! It makes my lips feel moisturized and plump. I love it! It has become my new go-to!", "image_url": "https://m.media-amazon.com/images/I/71AJCTsFvsL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "fc6a5360-60cb-4920-a527-62990ee0cf2c", "text": "Gross, stale, chemical fragrance, no flavor - or at least I have not tasted it as it appears to be at least A DECADE OLD. It’s crumbly. It’s hard. I had to use a fork just to make a dent in it. I cannot fathom that any legitimate vendor actually sold this item with a clear conscious. This is nasty and a total waste of money. Don’t bother!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71eA+V3YHuL.jpg", "sentiment": "negative"}, {"review_id": "91de1254-a0a0-47eb-b708-b6605b41c990", "text": "I got these to put my homemade lotion in.  They are great, no leaks. I'll be ordering more of these.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61+nXnAqBgL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "c171a2a0-e64c-45e3-9a80-b6ea0388f379", "text": "This is the cutest set for DIY lip balm or lipsticks.  They are so unique and definitely get noticed every single time you take them out and use them!  My friends always have to touch them and hold them because just looking at them isn't enough.  They want one for themselves with each new tube design they see.  I am beginning to realize these would be a great idea for a DIY home based business.  They are so unique and they actually are a good quality product.  I am not sure how many times the lip brush can be used over and over again but I am looking into replacing them and it doesn't look like it will be a problem.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/31LBLNSkrSL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "6753aa91-b774-4214-a6b1-74d54399a4bd", "text": "These tubes “leak” a tiny bit into the bottom of the tube when pouring them however they did not leak out the bottom at all and overall I am very happy with them. These also come with cute little labels!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71mBcmc5FcL.jpg", "sentiment": "positive"}, {"review_id": "3857c4a1-3e7b-4306-a555-e247a6f91c56", "text": "Me realice Micropigmentacion en los labios y este bálsamo ha sido genial.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91VMGvYl+yL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "85018b5f-0dfe-46e7-9326-4b6ebe06beb7", "text": "I thought these were lip oils didn’t realize they were just clear lip gloss but I love them! 1. They are so pretty with the flowers. 2. You can taste the flavors. 3. So moisturizing 4. The gloss lasts for a while on your lips. I kept 2 of them and gave the other 2 to my daughter. Will continue to purchase these, will get more when I run out.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61XdKQ-ysVL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "c94ab19e-9223-4e61-ba52-837c65e5b8b2", "text": "Muy hidratante", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81kJfggTwVL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "462bab59-a880-42f0-b185-68c892eba41f", "text": "This lip gloss has a great scent and keeps my lips feeling soft. I love that it’s made with cleaner ingredients. It’s a fair price point for the quality of this product and I would buy it again.", "image_url": "https://m.media-amazon.com/images/I/81IEVO9yM7L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "42a0887a-bd24-471d-a4ec-fe87c2f1ca0f", "text": null, "image_url": "https://m.media-amazon.com/images/I/61tS4wXURZL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "bbf85674-911c-4fe2-8d99-c58ed4ef9243", "text": "Watermelon Mist. Easy to apply. Tint accurately described. I reapply lip balm often so not sure of the longevity, but it goes on smoothly. Nice, light aroma. Fair price for totally natural. Will purchase again. Note: when twisting to raise balm, I was unable to decrease the amount twisting in the opposite direction. No sunscreen.", "image_url": "https://m.media-amazon.com/images/I/41Q1BSNUeaL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "b34f9d7c-9594-4dd9-a186-a353186d9dbc", "text": "Out of 4 tubes that I used for lotion bars, 2 of them leaked all the way through and had to be emptied and tossed and the other 2 leaked partially. I kept those so I attached a pic. These were gifts and I wasted a lot of premium ingredients in these that I can't give away. This is the best one that turned out.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/717JhG6KSoL.jpg", "sentiment": "neutral"}, {"review_id": "5c97d65c-9018-4f29-9ba2-79d331b1c752", "text": "Absolutely love this lip butter, it feels so hydrating on my lips. I was worried at first when I saw it was pink, thinking it would leave an awkward pink tint on my lips, but it's actually pretty clear, I love how it looks. My lips are plump and they look juicier than ever.", "image_url": "https://m.media-amazon.com/images/I/81bybkgjXDL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "05bc7d84-350c-4bb5-88b4-87dbdd0c3678", "text": "I am fair skinned and often burn, even in the winter. My family jokes that I'm the only person they know who ends up with a sunburn on Thanksgiving and Christmas living in zone 6A. It's sad, but true. And if you've ever had sunburned lips, you know it's something you don't want a repeat of. Blisters and cracking are terrible, but on your delicate lips they make speaking and eating torture.<br /><br />I'm quite pleased with these so far. Panama Jack is a great brand and known for their sun care products. The lip balm is excellent. It has a broad spectrum of sunscreen included, the scents are great and tropical, it goes on feeling smooth and moist, and it lasts! It need reapplied every two hours or every 80 minutes if you're in water, but it definitely helps! I can feel it on my lips, although it goes on smooth and soft, and I know it's working to keep me from getting burned. Honestly, I'm not sensitive to any of the ingredients and in a pinch, it's even great to put on my nose to protect it in the harsh winter, but sunny conditions here.<br /><br />The multi pack was an awesome value. Seven balms cost less than getting three or four separately. My only negative was that the lid on my mango was busted, but it is still moist and I used an old balm lid to make sure it didn't dry out. I'll definitely get more of these. They don't really have a taste, but they smell amazing. They're clear to white in color and don't deposit any color or stain on my lips.<br /><br />Reputable brand and skin protection! I can keep one in the house, one in the car, one in my purse, one in the medicine kit, and then extras for when I run out or lose one!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61e824g3kaL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "31de2da1-c8f7-4c42-abac-ee4219c8954c", "text": "The product description starts with such a wholistic and natural start of “three oil ingredients (avocado oils, sweet almond oils, and apricot seed oils) that are effective in caring for dead skin cells on the lips and make it moist and smooth.”<br /><br />The Good:  the overnight product was absorbed by the lips, and seemed hydrating the next morning.  Will update this review after a month or so for a longer lasting impression of effectiveness.<br /><br />The Bad:  Avacado, almonds, apricot seed oils seemed so... natural.  Except the first 4 or more ingredients are chemicals.  We are still looking them up to understand what we are putting - well, make that WERE putting - on our lips.<br /><br />Product seems to do what, it claims - just the chemicals are not for us.  Perhaps the description should be updated and include the chemical ingredients so we consumers know what we are getting into?", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81BoVVwrVvL._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "7330f784-9e79-43cc-a22f-1f78b05c1fc9", "text": "This is a decent lip oil. It's very sticky  , but I like that . It's good over lipstick or alone. I definitely recommend this product.", "image_url": "https://m.media-amazon.com/images/I/71KM0bIbHZL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "9fae38c5-167b-41cc-a666-d0dcbb87f050", "text": "This product is really neat. It works well for moisturizing and giving a bit of natural color. I love the casing as well, so elegant. But it does leave a weird taste on your lips.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/31H8t-yrYyL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "ffb103fd-ee85-4a44-9736-fd2c30d25020", "text": "Best lip balms tubes I have found! I have been making lip balm for years and these are amazing quality compared to all of the others I have purchased! The plastic is a good thick quality and the lids fit perfectly. I will definitely be purchasing these again!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71aGC1sgjJL.jpg", "sentiment": "positive"}, {"review_id": "30924b45-e0fb-404e-86d7-f5aee8ff3041", "text": "Super cute, works with standard lipstick molds. Very happy!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71DHaRw4-xL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "72c49c35-a300-467d-837f-a5ebdbf71b86", "text": "This is exactly what I needed.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71HpnJxH8uL.jpg", "sentiment": "positive"}, {"review_id": "711de334-754c-45d8-b37a-bafa20caf4be", "text": "Well these are pretty but I thought they were red and 5 came broken... ☹️", "image_url": "https://images-na.ssl-images-amazon.com/images/I/911zOuw38dL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "c961db57-83d6-4a4c-9c1d-f62e59e1cd05", "text": "I used these in my gift bags at our bumble bee baby shower and they were perfect. The bottom twists up and the cap is secure, so you can apply it several times. They are small enough to go into bags with other goodies! They're pictured in the sheer black bags in the picture.", "image_url": "https://m.media-amazon.com/images/I/61FaGsYXmhL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "d6ca1e02-5024-440c-9f5b-13e81f99058e", "text": "These round tubes are perfect for the lotion bars that I make. I especially love that they twist up.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71LvE-JBMRL.jpg", "sentiment": "positive"}, {"review_id": "726c7521-6802-49bc-9551-c2061d990bd0", "text": "[[VIDEOID:6a336a0274157ec4a5ecd4e59bc36c39]]", "image_url": "https://m.media-amazon.com/images/I/91pK3sVJoML._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "c474793c-4ae7-436a-85a8-974d68e39124", "text": "Not only did the tubes arrive dirty with dust inside them but I was given a completely messed up unusable stopper. I bought four bags and these tubes aren’t cheap so I am very disappointed that I can’t use one of my tubes now and I had to thoroughly clean all tubes.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71QrF2zi4tL.jpg", "sentiment": "negative"}, {"review_id": "750926fc-8324-4de7-a03d-fe7fbbcf5846", "text": "Cute add on to our lip gloss collections. Just don't fill the tube all the way because once you put the stopper in it will push the gloss out or refuse to go in.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/814ng2evQyL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "2217b539-b61c-4af6-a830-e9a24941e71d", "text": "Cute but the lipgloss will come out if you insert the little thing that goes in before the tube. So I decided not to use it.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81bFLSenMNL.jpg", "sentiment": "positive"}, {"review_id": "8fa79b9e-6eae-4ffb-a893-fcb10558f02a", "text": "First product I have ever been totally disappointed in.  There was no safety seal on product. Product looked as if it had been used, and the outside lid looked like it had been in someones purse for years.  It was just gross.  I thought it would  be a nice smelling chapstick but it wasnt even that.  Never again.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81DuQXrhAIL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "bb5df4c9-2e44-430b-92d5-01b85923a090", "text": "These come in a small box with a pack of 12 empty lip balm containers. I ordered the purple ones. The actual shaft of the lip balm is clear with the twister and the cap being purple. I made a mixture of my own essential oils of peppermint and lavender and then added up a mix with shea butter, coconut oil, beeswax , color and warmed it up. I used a pipette to fill it into the containers. This was very easy to do. You have to make sure you fill them while it is warm enough to pipe. I just filled it right up to the top and then if it isn't just the way you want it you can twist the bottom up until its just right at the top. At the end I only had enough to fill 3/4 of one so I just twisted it until it sat nicely right at the brim of the lip at the top. I just capped them and I popped them in the fridge to set. Easy process and no leaking. This is so easy that I probably will never buy chapstick again I can just make it. Looking forward to trying different combinations of oils colors and flavors. I received a discount in exchange for an honest review.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71Ei5XzBs6L.jpg", "sentiment": "positive"}, {"review_id": "07d08466-103f-43ba-a45a-da5786e44832", "text": "Box arrived ripped.<br />Tops and tubes scratched some were dirty.<br />They need to be individually packaged.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/8153+HdliHL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "02bd1bab-21fe-4565-bd9b-1087979f30fa", "text": "I was really excited when I received these lipsticks, until I opened the package.<br />The plastic bag the lipsticks were in was nicely closed, and around 3 of the 4 lipsticks was clear plastic, just not around the 4th one. This made me suspicious, and when I opened it I could clearly see that the product had been opened and used before (see pictures).<br />Unfortunately these lipsticks will have to be returned.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61LQHOvx0fL.jpg", "sentiment": "negative"}, {"review_id": "3f8c6379-287b-4a36-a271-28ec29c513a1", "text": "I believe the lip balm itself is decent but mine arrived with the bottom dial part broken off and the inner part on the bottom was cracked. The lip balm was dialed all the way up and the edges broke off when I took off the lid. I can still use it but not easily.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61srebuDDYL.jpg", "sentiment": "neutral"}, {"review_id": "a51371f4-df8d-425f-907c-487eee78b25f", "text": "This is the best chapstick I’ve used in a long time! Not sticky, not too fragrant or too flavorful. Went to the desert for the weekend and my lips were so dead, used this just a few times and they were hydrated and smooth! LOVE this product!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71R4Cyl+jBL.jpg", "sentiment": "positive"}, {"review_id": "70d55ecd-9290-464a-9d27-ddd5f46cc8fd", "text": "No flavor, drys quickly, doesn't rub off, lasts a long time. I did ho over it a few times to get it a little darker.", "image_url": "https://m.media-amazon.com/images/I/81aBONJNCVL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "1427d445-26b7-43e5-8545-e6572455149c", "text": "(Ingredients list is at the bottom of this review.)<br /><br />I'm so glad I ordered the Frankies Bikinis Lip Butter Gloss in Lilikoi. It's a really nice, smooth, emollient, buttery lip gloss/balm with decent staying power. It lasts on the lips, and doesn't require too frequent re-application. It also has a comfortable, smooth slip to it, and it is not sticky. The balm is yellow, but it goes on sheer. It doesn't look tinted on the lips.<br /><br />The flavor is lilikoi, which is apparently another way of saying passion fruit. I'm not usually keen on passion fruit flavor, but this one is surprisingly nice. The flavor/scent is sweet and pleasantly fruity. Like a sweet, very lightly floral-perfumed fruit. It's really nice, and not at all off-putting or overpowering.<br /><br />The packaging is excellent. The graphics and colors are beautiful. I also really like how the applicator is dome-shaped, with no sharp edges or openings to damage the lips. It makes it very easy to squeeze out the lip balm and apply it quickly. The formula and applicator also makes it difficult to squeeze out more than you intended, and that's important. I have found that feature lacking in some other lip products, and I've wasted a lot of product unnecessarily.<br /><br />Overall, I'm really happy to have this lip gloss/balm, and I will continue using it. I'd highly recommend this to anyone looking for a nice glossy lip balm to try.<br /><br />INGREDIENTS:<br /><br />Ricinus Communis (Castor) Seed Oil, Rhus Verniciflua Peel Wax, Rhus Succedanea Fruit Wax, Helianthus Annuus (Sunflower) Seed Oil, Natural Flavor, Euphorbia Cerifera (Candelilla) Wax, Ethylhexyl Palmitate, Tribehenin, Sorbitan Isostearate, Palmitoyl Tripeptide-1, Tocopherol, Copernicia Cerifera (Carnauba) Wax, Theobroma Cacao (Cocoa) Seed Butter, Limnanthes Alba (Meadowfoam) Seed Oil, Borago Officinalis (Borage) Seed Oil, Hippophae Rhamnoides (Sea Buckthorn) Fruit Oil, Rosa Canina (Rosehip) Oil, Monoammonium Glycyrrhizinate, Mica, Titanium Dioxide, Carmine, Tin Oxide.", "image_url": "https://m.media-amazon.com/images/I/716qTBp3+tL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "90a1e312-250c-4303-b039-bbfaecff4fce", "text": "It just does not look right having all that space on the top and then you pull the wand out and there's even less in the two it does not look good maybe if you're using it for personal but to sell it it looks bad with as little as left in it when you pull the wand out you might as well sell for a dollar and hope somebody buys it I think I think I'll stick to the tubes that I've been buying I won't buy these again. I would be embarrassed to sell these", "image_url": "https://m.media-amazon.com/images/I/71epzPzPq8L._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "9591d890-153c-49f9-8127-0c8b5aaeb830", "text": "This was a really sweet addition to my bridesmaids proposal boxes ! I bought the little ring cut outs for the lipglosses on Etsy. All of my bridesmaids were blown away!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71RhKxp8lQL.jpg", "sentiment": "positive"}, {"review_id": "b342b741-5489-4cec-acbc-85c869362667", "text": "Love my items.❤ Arrive on time and good condition..but only disappointment😒 I didn't like is that i didn't receive all of my white stoppers as you can see pictured i only received 15 stoppers instead of all 20 stoppers I paid for 20. I purchased these cute containers to use for my business. But i can't use them yet. Because; I Still haven't received a reply back from owner...😩😔", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71g4iF+GLvL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "652dc760-3adb-40b8-bd3d-0070d73aa50c", "text": "Works as advertised. Excellent quality. Goes on smooth. Soft on the lips. Moisturizes all day. Great flavors: peppermint bliss, citrus splash, and orangesicle. The scent is very light.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61m+G16EInL.jpg", "sentiment": "positive"}, {"review_id": "ab284b3c-64c6-407d-8c8a-4eaaef541835", "text": "Good amount for the price and very good quality!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/714dYGq8ahL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "2235715c-fd47-41fc-bfb3-a579de9ff602", "text": "Although this product is sturdy 2 out of the 3 I used leaked. I bought six and will not use the remains 3 due to leakage. I cannot sell my products  using these containers.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61EQNAe9TkL.jpg", "sentiment": "negative"}, {"review_id": "8d409103-4576-46b2-86c7-06494c03522a", "text": "Works great for my needs", "image_url": "https://m.media-amazon.com/images/I/A1HSODMyEPL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "fad8a11a-eb82-4c20-b87f-b5c7b95b4da8", "text": "I am a fan of MARLOW products...I have several others not included in this set and all are great. I'll break down each product briefly below.<br /><br />BAG: Very nice, basic black but well padded and holds it's shape. I basic in shape but I higher quality then usual.<br /><br />SOAP: Great balsam/fir scent. Excellent balance of exfoliation and suds. Leaves body invigorated, soft and smelling great!<br /><br />SHAVE: Has a tea scent, hint of some sort of alcohol. Builds into a creamy texture, not much sud but decent coverage. Does it's job. Finishes with a clean scent.<br /><br />FACE WASH: Nice balsam/fir scent to it. A little goes a long way! Very slick, seems to not penetrate but wash the exterior of skin. Takes some work to wash off. Finishes with a green tea scent and refreshed.<br /><br />FACE MOISTURIZER: Has a tea/alcohol scent at first...Goes on smooth. Dries fairly quickly, leaving a sweet green tea scent. Leaves face feeling soft not oily.<br /><br />POMADE: Great scent, more cologne like. Goes on easy, not too tacky or slick. Does a decent job.<br /><br />LIP BALM: Awesome balm!!! At first I thought it was an odd addition to the set. But man I love this balm. Goes on with a hint of sweet tea. Not waxy, not glossy, just a perfect balance that keeps lips moisturized.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81J7F+CgJXL.jpg", "sentiment": "positive"}, {"review_id": "d66094e1-314e-45b7-b418-e1b08e762e19", "text": "These little lollipops are a little annoying to fill because the hole is so small and they came twisted so tight it was a struggle to unscrew some of them if not all of them", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81cRAqjfv9L._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "74b8c355-d280-4896-8d06-f9015548f0d9", "text": "Very pretty but SMALL. Mind you, I have small hands. You can layer it on and make the color more strong/ vibrant. It can be used as a simple tinted lip balm. Moisturizing but in my experience, doesn't last very long. Not a good investment, but if you only want to support the boys and don't mind the price, it's worth it.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/712bsPVWJQL.jpg", "sentiment": "positive"}, {"review_id": "8f26fad3-68c7-4d4d-bf9d-758a1e690306", "text": "These worked just fine for me, no leaking.  The push up mechanism works just fine as well.  I will certainly be ordering more as these went over well for my lotion bar.", "image_url": "https://m.media-amazon.com/images/I/21lgTexxVxL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "9a72ab04-f492-45e2-aebf-9c8b47636b87", "text": "What a waste of time and money!! I was very excited to get these tubes to use to make my homemade lotion bars. When I poured the oils into the tubes, the oils when straight to the bottom, leaking out on to my kitchen counter.  The last two pictures are of when I tried a second time to use these tubes by emptying all the oils in the tubes, cleaning them out and started over. At this time, I cooled the oils down so they would not be so runny, but a thicker consistency, but the oils still leaked to the bottom of the tubes (each one). Sorry, not very happy with this purchase. Will not buy again! I was making these bars to give away as gifts.  :(", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71GvDAteIML.jpg", "sentiment": "negative"}, {"review_id": "120637c2-3b3e-4f0f-9086-b512f355e0d5", "text": "Delivery was super fast (prime membership)<br />I chose the shade \"I am busy\" based on a personal preference and consideration of my skin tone. This shade is so beautiful. Product is WET but absorbs very quickly and does NOT dry and crack your lips like other matte lip stains. Wears well and removes easily with Micellar water whenever you are ready to remove it. Adding lip gloss over Wil make the color pop more with shine if you prefer. Definitely ordering again! I added a couple of pics for reference of the shade  I AM BUSY.", "image_url": "https://m.media-amazon.com/images/I/61NQD+MaZqL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "1eadddbf-bf8d-4089-9cd6-5a1ac987b13f", "text": null, "image_url": "https://m.media-amazon.com/images/I/71xu8hZSf1L._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "f51463f2-2fb1-4819-addb-16ce02de9784", "text": "Make you lips soft and supple.. helps to protect during the dry and cold months.. love it", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71CTOKvhcYL.jpg", "sentiment": "positive"}, {"review_id": "fba30716-9613-4214-8f37-d0dc1050b93b", "text": "I cig have been looking for this ever since the stopped selling it at Walmart. All my friends have stolen at least 3 each from me because they like them. So I decided to buy a case of them. They really should branch out to other stores.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/715weZMoGgL.jpg", "sentiment": "positive"}, {"review_id": "1afcafa9-f740-40e6-b6e4-2518820fba4a", "text": "I've used Marlowe products before, and have always been happy with them. This kit has just about every daily hygiene product a guy needs and is a perfect option for traveling or just daily use at home.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81tmSFcO6RL.jpg", "sentiment": "positive"}, {"review_id": "6a49c120-031f-449d-9f51-e605ec058b7e", "text": "Bought this as a gift for my vegan friend. Didn’t realize how small it actually was until I received it! Seller may want to emphasize the small size in the description; including a photo of the actual size so customers are not as disappointed as I am. Will add a quality review once she tries it.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71iZunIEVuL.jpg", "sentiment": "negative"}, {"review_id": "601a5fae-7a47-4ec8-b28c-caa93b4c7ff9", "text": "These are very cute but are very tiny!! I didn’t expect them to be this small but they do the job and will definitely work for my gloss business :))", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61sJlFnqgJL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "bbb70887-0d26-46ac-9be0-d4cfa41821b6", "text": "It has a nice peach smell and moisturizes my lips well, but it doesn't last as long as my Banana Boat one.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/618DdM-ejvL.jpg", "sentiment": "positive"}, {"review_id": "0a51b4b5-8584-4aae-a52b-f423ce288f59", "text": "It has a nice peach smell and moisturizes my lips well, but it doesn't last as long as my Banana Boat one.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/618DdM-ejvL.jpg", "sentiment": "positive"}, {"review_id": "0216dd0c-9062-4fd3-af45-5376858cc569", "text": "I love these. I used them to make a beard wax and they are the perfect size.  The butter hardened perfectly and the spin up works good as well. I will be perfecting these again.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/B1sG0IKhCZS._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "122b7a08-8fef-417f-8deb-706b2516887d", "text": "The tubes don't leak, it looks just as advertised and the stoppers are easy to put in. Even tilting upside down didn't leak until I shook it.<br /> The brush starts off stiff and I had to drab rather then smear, but after a day it began soft and gentle.", "image_url": "https://m.media-amazon.com/images/I/61RHFTuIYPL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "81abdbca-293e-4aad-8a61-c55c3e172337", "text": "THEY ARE BEAUTIFUL, BIG AND GOOD QUALITY... I LOVE 🤗🤗🤗", "image_url": "https://m.media-amazon.com/images/I/61KOeACqHzL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "8da81670-8f38-467c-a076-8a59a9254344", "text": "My 4 year old daughter loves lipstick because she wants to be \"just like mommy\" let's justs say, 4 year olds and lipstick do not go together because it gets everywhere and stains EVERYTHING. Not this stuff! This stuff provides the perfect natural tint while keeping my lips smooth and hydrated. It changes to a deeper color the warmer your lips are. And IT DOESN'T STAIN. I actually use it just as much as my daughter does, and boy does she love this stuff.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91aACdMC0WL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "b6f956b1-c125-46d9-b109-0c683ddbf276", "text": "Not good and did not suit me Please be careful, it will expire soon, so I returned it", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71qba5ZBdpL.jpg", "sentiment": "negative"}, {"review_id": "9903c50a-ce53-4e86-bb0e-916a836e6c19", "text": "I was a little bit disappointed because this doesn’t really smell/taste like fruit or chocolate but I have used it twice and it has a nice lasting consistency.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51bGFTcImCL._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "481e705a-a6d4-4c50-9316-d73b977b3fbc", "text": "I will update on the product it was a fast shipping delivery 🚚. *but very small 😣 Update It's Trash It literally is thin and drys out it's definitely not worth 17.99 .", "image_url": "https://images-na.ssl-images-amazon.com/images/I/515h3lPpQIL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "b28e83c7-3676-4ff1-b234-7adcb4549530", "text": "Super clean & doesn’t get too dirty. Durable material and cute prints ! They also make a great small and thoughtful gift !", "image_url": "https://images-na.ssl-images-amazon.com/images/I/B10C2nCNphS._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "7b06a587-7470-4c01-82fc-cd1bd2de62e6", "text": "I tried dozens of lip balms and none were impressive. A friend recommended me this one and swore by its quality. Boy, was she right! I love it. It’s moist, it doesn’t dry fast on the lips, it feels great and smells nice. It came nicely packed too. Very impressed.", "image_url": "https://m.media-amazon.com/images/I/C1fZv3N8KMS._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "ff7fd69e-7061-4ac7-8868-94d625ff5a90", "text": "These are really nice lip gloss tubes. They are thick and feel professional and also easy to fill. I plan on buying more to put our lip glosses in to sell.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71K-78t63yL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "5e2586bf-0d0e-4143-8450-d2e8034cb2fa", "text": "The scent was poor, it does not moisturize at all like the original eos, and the whole ball fell out and broke after 3 uses. Waste of money! Would NOT recommend!!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61Gp7ngCoGL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "107e41fb-0878-4fdb-b601-75d91ef5d663", "text": "I purchased this 11 pack, weird number by the way, to put together some favors for a baby shower I was hosting. They were such a hit! The scent was so yummy! The package came in a timely manner with no damages or mishaps. And the buyer was very easy to work with. Just what I needed. Now if only they sold them in more than just sets of 11...", "image_url": "https://images-na.ssl-images-amazon.com/images/I/719isIuafSL.jpg", "sentiment": "positive"}, {"review_id": "dff28970-23b9-4316-b954-0be78a522493", "text": "El empaque es encantador, adornará mi mesita de noche y espero que cuando esté dormida me dure la hidratación, porque lo aplique y no entendí si fue que no resistió o me lo comí.", "image_url": "https://m.media-amazon.com/images/I/718iihp7bjL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "ed7004d8-bcb1-40aa-a22a-95a1fd4c9ab1", "text": "I love them. I know a few people selling keychains with these wristlet sets and I knew it would be cheaper to make my own. Plus, I can switch out the wristlets when I get tired of looking at the same one after a while. I even started making resin letters to go with each one. I love them! 😃 I'm sure I'll be purchasing more colors in the near future.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61nO9R2+iwL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "8227146a-5b86-4f9a-9e29-3cb36d2c2e75", "text": "Nice tins but 4 came very damaged/dented, disappointed because I needed to use these for a craft show and don't have time to return/get new ones.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81WDJBdbmsL.jpg", "sentiment": "negative"}, {"review_id": "c659ea00-9473-495c-9bba-d66a922e15b1", "text": "Be careful before you try raw shea, it is very likely to cause skin allergy because it is raw and might contain sources of skin allergy.  Plus it is very greasy and does not absorb at all. This raw shea cause rash on my neck and arm and clogged my pores. I would not recommend it on the skin. Furthermore, the seller is quite irresponsible when it comes to return the item. The seller authorized my return, but canceled my return when I shipped the items at USPS with the label they authorized.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61FepOdp5kL.jpg", "sentiment": "negative"}, {"review_id": "1eb0d427-0b60-432f-b9e7-24ee4ca26d06", "text": "fav chapstick", "image_url": "https://m.media-amazon.com/images/I/71kSi6sRjXL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "1f5da1df-e51f-4d93-90a4-ea2ba6026e64", "text": "I got this specifically because it says spf 30 in the description. When I received them in the mail the ingredient list on the actual item does not have any type of sunscreen listed.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61nG67b6zHL.jpg", "sentiment": "negative"}, {"review_id": "fdd9cafe-b134-4b9e-8cbd-9f2b7b8baac2", "text": "Very happy with the glow, the color and the ease of application!  I was looking for a “clean” makeup and this more than meets my expectations!  I typically have very dry, mature skin and often makeup ends up looking too dry and/or emphasizes wrinkles.  This makeup feels hydrating and brightens. I am a new fan of rms!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71M4469njqL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "2215910d-804e-4463-9758-5f064eb321b9", "text": "These lip balms are amazing! They're the perfect consistency. Good coverage, but not heavy. Very silky feeling and doesn't wear off too quickly. Good flavor/scent. The mint mojito is DIVINE! The perfect amount of refreshing tingle. Love the ingredients, I like to keep balms around that my kids can use freely without junkie ingredients. Also love supporting small businesses.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51A-tpe3ylL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "11f37676-0c3a-418b-9279-2b0f62c29dd1", "text": "I Like these tubes. Very easy to work with, some of them you have to press the stopper in harder. Other than that they are good. I’ve order well over 100 already. @irinicolebeauty to check out more.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/41eP2CS32ML._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "c2dfacc3-322c-4955-944d-b7ce230e67f8", "text": "I bought this cocoa butter because I make body butter. I like the fact that it does not have a strong cocoa smell. But that was the long good thing about this butter. There was a grey discoloration at the bottom of the bottle when I looked at it I didn't see it until I started using it so I can't return it but it look like it's a old batch that got sent to me", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61G-mym7TJL.jpg", "sentiment": "negative"}, {"review_id": "19b156f2-4345-4ce0-833e-27f03fa0fbc4", "text": "I received my order and I am happy about the product. The lipstick case is great quality and I am able to fit 3 regular size lipsticks inside!<br />Thank you fo the great product!<br />Let me know if my review is helpful to you by pressing the button helpful!", "image_url": "https://m.media-amazon.com/images/I/81R9u43OIyL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "56e59b24-8d1a-4af2-9d65-49e3f6268b79", "text": "This is an exceptional lip balm. The tube is smaller size than \"regular\" lip balms so it fits easily in any pockets. It is probably good for men as well, who don't carry purses, being black in color and having such a discreet size, you can barely feel it in a pocket.<br /><br />Despite the smaller size, there is a lot of lip balm in it. The whole tube is filled with it. The mechanics are outstanding, the bottom cap is turning smooth with the precision of a Swiss watch. It gives you the feeling of elegance and luxury.<br /><br />The lip balm itself takes effect immediately, you will feel your lips smooth and flexible right away, it is almost an overwhelming sensation in the first couple of seconds. It has a nutty smell and taste, I would actually gladly spread it over bread for breakfast. it feels natural and edible. It reminds me of the freshly made cookies of grandma. It is an exceptional natural lip balm that you cannot believe you just found given all the chemicals out there.<br /><br />Along with the exceptional lip balm there are other samples from the same awesome company as you can see in the picture.", "image_url": "https://m.media-amazon.com/images/I/81rb9b2eY9L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "7b6022c2-bfdb-4bd2-b29e-bafa0e7808fc", "text": "This was supposed to be a dark red-brown. It's barely pink. My lips are naturally a darker pink so this barely changed the color. I think the good reviews and the tik toks are fake. I saw this exact color swatches on tik tok and it didn't look anything like this.", "image_url": "https://m.media-amazon.com/images/I/C1DQoSF2LwS._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "ed072aaa-818b-4dd7-9a82-e09319fac9a1", "text": "I’m not sure if i got a defective batch, but they leaked ALL OVER THE PLACE. About 6 out of my 12 tubes needed to be refilled. I literally had to put them in the freezer to solidify them and then take them out and refill them. I wasted so much h product. Huge disappointment. If you have a liquid base, don’t use these!!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/615dNnY5U-L.jpg", "sentiment": "negative"}, {"review_id": "380a437a-aac8-403b-8b8f-5e648a6676a0", "text": "This is the only Chapstick that I can use without my lips breaking out because they are sensitive. I will always be biased and I love this brand.", "image_url": "https://m.media-amazon.com/images/I/6195IIFuvYL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "69928bd8-967d-48fb-acc6-88371053f9be", "text": "Love this product, size, and quality! A similar product I buy from my hair store (shown left in the photo) is upward of $7 and only 10oz, so I’ll definitely buy from here now. Texture is smooth, and smell is as wonderful as expected with shea.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61YUi-g9S0L.jpg", "sentiment": "positive"}, {"review_id": "55d446c9-4fdc-48f3-bdbb-9dfdf2e31ece", "text": "Very moisturizing, so glad that I had it with me on my 15 hour flight and during my hotel stay.  The smell of coconut is not overwhelming and it doesn't leave any residue.  I love that it has simple ingredients and it's certified USDA organic.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71Oriz0o1bL.jpg", "sentiment": "positive"}, {"review_id": "ca652817-5274-45be-af88-e41bb5522b9f", "text": "Moisturizing and flavorful at the same time! I swear we go through chapstick like no tomorrow here. The tubes are the usual size and with a large pack, come in handy for keeping around the house and cars. These would also be great for stocking stuffers for the holidays! The flavors are strongly scented, but mild enough to not pick away if the taste were stronger. Overall, these are a great pick for an affordable yet well protected chapstick.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81AIISmnzFL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "578a581e-3dfc-4a6b-b010-7fddb554fa80", "text": "This was also quite disappointing! This is not pure cocoa butter at all let alone ‘ORGANIC’ and I actually bought 2 jars!!!<br />I would have returned this for my money but I travelled abroad right after purchasing it! Buyers beware.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/714YhyLgpHL.jpg", "sentiment": "negative"}, {"review_id": "15cf6ca1-cb10-496b-bd32-4d41d2a80491", "text": "For some reason I thought they'd be bigger but they are really tiny.<br /><br />Some are faulty .. like they just dont look perfectly cut but i got all 100 and they all work fine. Didn't take long to deliver.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/811fI8VdIxL._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "749a0bc0-d1ea-487f-9c72-4516ea3b4e94", "text": "These are so cute. I can’t wait to fill them up. Will be ordering again. I was scared because no reviews was available. I am satisfied and happy with them. Even though it was in the bubble envelope I think it still should’ve have some extra wrapping inside. Some tubes had slight scratches but nothing major. Thanks!!!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71aQZaxCH8L.jpg", "sentiment": "positive"}, {"review_id": "3c3111f1-b1d8-41e6-8dac-47ff744ba72e", "text": "I got these to try making lipgloss for the first time. I knew they were going to be small. I was surprised that each color filled about three small containers. I made these for a gift for Christmas for my sister. She loves them.", "image_url": "https://m.media-amazon.com/images/I/81YuXjTst0L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "13b1792e-2ce5-415d-b596-4b8c7447b3ee", "text": "I love how small they are. The colors are fun. The consistency is great, I would get this again.", "image_url": "https://m.media-amazon.com/images/I/61mOfjcREEL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "b558b35c-9ddd-42eb-8c3c-c4bfd6a23da5", "text": "My lips tend to get very chapped with the different changes in weather so I go through a lot of lip balm. I saw this cute 10 pack of emoji lip balm and just had to get them, especially for the great price. The pictures are printed very nicely and the size of each container is perfect. I did notice that the packaging said mixed fruit flavor however, each one that I ha e tried seemed to be completely flavorless. The flavor doesn't bother me though, as I just need it to moisturize my lips and it does just that.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61NRay1AhBL.jpg", "sentiment": "positive"}, {"review_id": "61b847c9-1f91-44e8-8ad6-c743f8d6f309", "text": "Nice quality with cute labels. Doesnt fit in the lip balm tray i have so i am not sure how I will  fill them sucessful. I am not going to return them because i dont want to pay for shipping", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61Lr0hlDDUL.jpg", "sentiment": "positive"}, {"review_id": "17c3d047-ce5d-4ea1-9387-67cd2a826671", "text": "All of my tubes were scratched and looked used. None of my tubes or stoppers were wrapped in plastic and just thrown in a mailer which is unsanitary.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/712MvFZkQrL.jpg", "sentiment": "negative"}, {"review_id": "6dd1223d-0bc2-4450-a849-343da1f53454", "text": "Love I will be buy more", "image_url": "https://images-na.ssl-images-amazon.com/images/I/B1y8O309WWS._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "6ca027f7-79d3-483a-bd65-e3f3c7977096", "text": "I ordered the assorted pack for my wife and she LOVED them!!! Thanks to a few kisses from her, I really liked the Mojito one. It is refreshing and delicious!!! And because my teenage daughters also love these balms, I had to order two packs. We’re all hooked now. Best lip balms ever!<br />(And the packaging and personal note from owner was a super nice touch!)", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71g1awpQnvL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "fa94803b-3a10-4fb6-9d80-2f9ceee0dbc7", "text": "Lots of leaky tubes don't waste your money.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81LZuw0uB9L.jpg", "sentiment": "negative"}, {"review_id": "eb79cb34-b06b-4e5f-97f2-1360eddadcc2", "text": "Some of the bottles came with scratches and a bit cloudy not that happy with that part but the other bottles are perfect! So i gave them 3/5 rating", "image_url": "https://images-na.ssl-images-amazon.com/images/I/B1AaP0R1+uS._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "f1357ab1-42e9-4ff5-9772-31f2b5bf4f33", "text": "I love this toner!  It feels just as great as my regular toner and others I have tried.  I loved the bonus coconut lip balm as well! I am using both of these when I'm out and about and need to refresh my face. Overall quality product at a great price!  I will definitely buy this again when I run out.<br /><br />I have received this product at a promotional price for product review purposes. All opinions are my own and reflect my honest opinion.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71FS57gTHRL.jpg", "sentiment": "positive"}, {"review_id": "40bb1297-c536-4a3a-93c9-db77110ba07f", "text": "I am a lip balm junkie. I’ve tried every brand on the planet and have finally landed on Bee Bella. My favorite is mint but their other flavors are nice too. I love the packaging and the wood casing that it comes in. I hope this bomb never goes out of production because there’s nothing else like it!", "image_url": "https://m.media-amazon.com/images/I/61XZHnwbkpL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "b305286f-3cfb-4582-8a33-085b154c67e7", "text": "Love these tubes", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71NqG3dlSDL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "cf81ead5-9b54-4c52-a507-872ab37b37c9", "text": "The product looks very nice, the design is pretty, but the product itself is not good. It has a bitter taste, also leaves unpleasant bitterness when wiped clean off the lips.<br />I do not recommend this balm. Have to throw it away.<br />However, sheer pink tint was suitable for me.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61o1F4XRIRL.jpg", "sentiment": "negative"}, {"review_id": "fbe4a639-c8cf-43c8-a61d-57818cda583f", "text": "Impressed! Love That The Entire Bottoms Move Upwards So They Ensure Getting All The Product! Perfect For My Homemade Paw Butter. Also Love That They Are Made Here In The USA. Thank You For Making A Quality Product", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71WueDFz6+L.jpg", "sentiment": "positive"}, {"review_id": "000d0880-3621-4c2c-9a02-664645eba1fd", "text": "Impressed! Love That The Entire Bottoms Move Upwards So They Ensure Getting All The Product! Perfect For My Homemade Paw Butter. Also Love That They Are Made Here In The USA. Thank You For Making A Quality Product", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71WueDFz6+L.jpg", "sentiment": "positive"}, {"review_id": "7b77cfdc-20c7-4354-9d57-79f8f48a0c58", "text": "They all came, no broken pieces and had all the pieces", "image_url": "https://images-na.ssl-images-amazon.com/images/I/A1+lxA4JllL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "72ba1a79-e28f-4d5d-854b-995a64792197", "text": "Great lip balm that helps to soothe and smooth dry lips.<br />Made in USA with natural ingredients. Contains vit E, Almond oil, coconut oil, argan oil- everything you need for moisturizing your lips.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/B1xSRWPxcMS._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "9ae7e010-347e-4849-9002-c34abc48a8d2", "text": "I bought these lipglosses based on the look only and once I received it they looked just like the picture!! The gloss is shinny and long lasting and the taste!!!!!! It leaves your lips tasting so fruity and sweet I'll never get tired of these lipglosses. They're the best for lip combos as well!!!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/A1A3u1lIQUL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "4b015dda-b80a-4b67-90dc-5f73e6289176", "text": "These lipsticks are pretty cool. They are black but the colors are shades of red.<br />They have a cherry smell to them.<br />It is creamy but like a lip gloss. These are mostly shaded lip glosses and not a matte color lipstick.<br />I like that the lips stay tinted pink when wiped off.<br />They did not leave my lips dry.<br />I am wearing #12 in the picture.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/617EiHcCv5L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "5671675c-1fc6-4182-b94b-fddfe852730d", "text": "I ordered these for my daughter she needs more of these every week lol and lip gloss is somethings we lose ALOT! so when I got the bag of tubes I was excited to say it has every little piece you need nothing was missing our first lip gloss turned out great ! I give this product a five start because It is not a flimsy cheap bag of tubes, has the funnel lids twist on cap all of it is in the back it came in decent time ,these tubes are even re-usable and if you mess up just rinse it and try again (experience) these will last us through the school year thank god! Recommended !", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61ZoVJrM6kL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "713e5ff7-7377-4403-b7e4-7cbc095b340b", "text": "Love these. Perfect size. My daughter makes & sells her own lip gloss (oluvely.skin on IG) & her customers love these sizes. The application is soft, smooth & gives just the right amount of gloss.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71hhQnBZoiL.jpg", "sentiment": "positive"}, {"review_id": "a1cab5c8-5bf4-4fec-bb2a-00c6bbf59b1c", "text": "I am super impressed by this lip balm. It has been just a few days since I'm using it and I could notice the difference on my lips. It is 100% natural and has the best of the ingredients. It is smooth, firm, light and lasts a long time. Five stars to its packaging and fast shipping.", "image_url": "https://m.media-amazon.com/images/I/81Y2V5ZNt1L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "50984a20-34a2-4af2-b838-72ed7c2000e1", "text": "I added mine to my lighter leash . i wont be losing my lighter or Chapstick agian. Great product i would highly recommend", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81C6wm+eTmL.jpg", "sentiment": "positive"}, {"review_id": "d39aa14b-6694-4c48-8334-2acd5c6fdca1", "text": "Love this product.  This particular purchase not so much.  Had I known it expired in 2020 I wouldn’t have bought it.  Ad said new and didn’t picture the back of package with the date on it and frankly I didn’t think to ask. EOS lip balms don’t last forever and go rancid.  These are definitely on their way out…..waxy and flavor is off.  The package was also open slightly.  Great product not so great seller.", "image_url": "https://m.media-amazon.com/images/I/71HQMIliPEL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "62802216-ffb5-4545-9e9d-605973a3846d", "text": "I just love this one!<br />I am addicted to moisturizing lipsticks. I have been using Lush lip balms for the past five years, and they are great.<br />Two years ago I traveled to Madagascar, and I was running out of lip balm and had no choice of buying a new one. I bought this Lobello at the local supermarket, and I fell in love with it immediately.<br />I love the texture of this product; it is very moist but not too much to leave your lips wet. It has just the right amount of moisturizing.<br />What I like about this product, most of all is that &#34;pearly shine&#34; that you get on your lips. It is like going with color lipstick, but much more gentle. I love it. This product has nice, sweet, gentle smell and no taste.<br />My only problem with this product is that it won't last for long. My other lip balms last for a couple of hours, but this one last for maybe one hour before I feel my lips starting to get dry again.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71UZVOHtOtL.jpg", "sentiment": "positive"}, {"review_id": "a0ddee83-4cca-4c76-a488-5144c61875ea", "text": "I bought the tin trio when I lived in England and these smell just like those did. The Lemon is the strongest like lemon drop sweets. The strawberry is light but sweet. The violet smells like parma violet candies. As moisturizing as one would expect from a petroleum based product. Overall a great purchase and I am one to be skeptical when buying something without reviews to read. The shipping was fast as well.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81AAoPagn1L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "dfc31180-0863-4a6c-a746-dafb75810871", "text": "I love how this feels on my lips. I don't get that waxy feel, which is a big plus.  It was also delivered promptly and in a nice little package. 👍👍", "image_url": "https://m.media-amazon.com/images/I/A1lKSZ92dSL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "3d4ede08-8847-4b01-bd8f-cdf9fb1582f8", "text": "Love the look and feel of this tinted lip balm, I carry this EVERYWHERE I go! Easy on, keeps my lips hydrated and keeps me looking alive.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/615a9Pe5WML.jpg", "sentiment": "positive"}, {"review_id": "74169ba4-3cd3-4495-8b44-294d1b9f9d3e", "text": "They’re too small, it says 5ml so I was expecting them to be a bit bigger but they are super cute! I probably won’t buy them again but I will use them!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71kjRaXlLEL.jpg", "sentiment": "positive"}, {"review_id": "69f83b4a-d289-4186-bee7-61ea5d324dac", "text": "Not Detroit Grooming Co. quality.<br />Bought a single cherry lip balm as part of a direct order that included beard butters and a brush. That cherry lip balm was great like their butters and brush. (Far right in my picture)<br />This 3-pack was terrible. (3 on the left in my picture) Hard as a rock with no cherry flavor/scent. Even after warming it the balm is rock solid. Even less red color in those 3.<br />I’ve purchased Detroit Grooming beard butters and brushes, direct and through Amazon. All top quality.<br />This 3-pack of lip balm is not. Hopefully, it’s an anomaly or a wholesaler issue.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71syBWEaVyL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "fed019ff-78b2-47b4-8b7e-6d950423b66e", "text": "I'll buy it again.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71bRjEASukL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "c0018f53-3969-4369-9975-61f848798ad6", "text": "Very moisturizing and it gives off a very natural lip color.  No color transfer!", "image_url": "https://m.media-amazon.com/images/I/71bNcr0ctzL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "63859f88-cde4-4191-9eea-4113152f2fe7", "text": "I love this stuff but DO NOT BUY IT FROM AMAZON!  I thought I would take the chance and received a torn up box previously opened and dirty container!  Yuck!  The UPS package was fine.  Amazon just sent some creepy, dirty thing and took forever doing it.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71XV+ztUUPL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "44b20dc5-19dc-481c-924f-1aa87fe17d5b", "text": "I only ordered this because it says there's grape in it, grape is my favorite...it came with blue raspberry instead which I can't stand...how are people allowed to mislead what they sell here like that??? Very disappointed!!!", "image_url": "https://m.media-amazon.com/images/I/71+uRBPizmL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "b889d203-eae8-4f28-98da-52f7826ad883", "text": null, "image_url": "https://m.media-amazon.com/images/I/71cvyWGVH5L._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "13d24a3d-c5b2-4d5c-abfb-9717aaa40450", "text": "I already love shea butter for the simple fact that I have sensitive skin, anything and everything irritates my skin, this is the only thing that's NATURAL that leaves my skin not only relieved but moist and soft for hoursssss on end, not to mention glistening like a goddess. I'm giving 5 stars because of the packaging, the jars are just simply nice! ( and filled to the top (; )", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71QDsI-fYRL.jpg", "sentiment": "positive"}, {"review_id": "31edf6b8-8366-44c5-a20b-418320a9e396", "text": "They weren’t scratched my lipgloss plug thank you", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51t1ulIymML._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "53041ced-474f-4ffe-97b6-d899146e31e1", "text": "I have sensitive lips so I tend to only use nivea lip gloss but I wanted something with better sun protection. This one didn't cause my lips to get itchy or dry and goes on very smooth. There is hardly any scent to it and no flavor except for a slight sunscreen taste. Overall I like it because it provided great sun protection.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71MXSsnR7iL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "1e5470e6-47c6-4ce5-9596-c99c7fa812ee", "text": "I live in south Florida, so sunscreen and sun protection is paramount.  You have no idea how many people I know personally, who have had skin cancer, and there are lots.  I, and my wife, do like to wear lip balm, and having one with SPF protection is great.  These panama jack ones do have SPF 45, and have a great flavor.  I think I have enough with this pack to last me a very long time, and that is a good thing.  My lips feel very hydrated, and the added sun protection for every bit of my skin is a huge deal.  These are great for a beach day, or even for those chapped lips that often happen on dry winters days, which are approaching for you northerners. I know because I lived in Canada for 22 years.  Overall I love these, and have one in my pocket at all times.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61p4Qe-nTiL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "434723f6-4bb9-43c3-8ad1-4d31a16958b2", "text": "I ordered this product specifically because I love the scent of Lillikoi and don't see that many products with that fragrance. It has an awesome, pure, strong fragrance so I was very pleased with that! I think this lip butter has the perfect texture. It is very smooth and intensely hydrating. My lips felt absolutely amazing after application! I would order this again! Made in the USA.", "image_url": "https://m.media-amazon.com/images/I/6138BCv4ctL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "4bf9424b-e0d2-4b19-a74c-8c28cb5136b8", "text": "First off the positive about these lipsticks. They arrived fast and well packed. They come individually wrap in a box. Simple slick container, the colors are beautiful. It applies on smooth and very long lasting. Had it on for 9 hours never touched up even after drinking or eating. Love that these lipsticks do not dry my lips or make them look cracked like others do. Down side and my reason for three stars, the dot sticker on the box or the container doesn't match the actual color of the lipstick. You will have to open each one of them to see the real color. Also they are about to expire. I got them on December 18, 2020 and as you can see in the pictures they expire on August 14, 2021. Only 8 months to use them all before expiration. Yes they are made in China.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/916GmaAs-XL._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "45eb5525-f838-4fa8-9343-b1fd8b17f41d", "text": "The tin jars were bigger than I thought, but they worked out fine. I should have looked at a ruler before ordering. They look great except they’re very easily dented. Almost all my tins arrived with some slight dent and one was so damaged that I couldn’t use it. Because of this reason, I probably wouldn’t order again.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/717SD-l-7PL.jpg", "sentiment": "positive"}, {"review_id": "d96d4b1d-ae8d-40b0-98eb-985199357b5b", "text": "These are silky & beautiful! I was afraid the color might look gaudy, but the warm hint of pink is just enough to look sweet & natural.<br />The dried flower stick is gorgeous! The lipstick case is so Bougie! I love it!", "image_url": "https://m.media-amazon.com/images/I/61MUdoSxQeL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "aab1ce1d-b629-475a-9893-b3b193888486", "text": "I would give it zero stars if I could. Very disappointed, specially because the order kept getting delayed. I was searching for a new lip oil because the one I usually buy (in the picture) had been out of stock for a while. This is not lip oil, with lip oils you can see the  consistency when you move the tube. With this one, it’s like a cheap lipgloss, the color is something my niece would get from those kid make up Kits. Never buying again", "image_url": "https://m.media-amazon.com/images/I/61JUy-zJb6L._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "85fee9be-97d1-4fad-a323-7e7010c9eac5", "text": "I purchased this product specially because the listing says SPF 30, which is difficult to find. When the product arrived, it turned out to be SPF 15 (like almost every spf lipbalm sold). It also has a mild, but noticable coconut flavor which I don't love. Amazon should update their photo with the current packaging, which clearly states SPF 15 and coconut. I will probably give it to my husband (who likes coconut) and not order again.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81-TXHKTH2L.jpg", "sentiment": "neutral"}, {"review_id": "05f571ed-4523-499f-aaaf-48bd6bbf2364", "text": "This is LITERALLY, not figuratively, a GLUE STICK. DONT BUY IT. It smells like ass and it’s STICKY.<br />Once again... NOT A CHAPSTICK AT ALL.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/B1RIu1f5o2S._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "01ee772b-11d7-41ab-953f-5df017d9d54a", "text": "I love the product. It’s great. I’m disappointed of the packaging. The product comes out of the side and it’s very wasteful. I will not be repurchasing due to the packaging.", "image_url": "https://m.media-amazon.com/images/I/61oxTu2TyhL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "190bf221-ca8e-4478-8589-78f1782ac821", "text": "I love these tubes! They’re so easy to fill up and use!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81ugWTMr79L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "88cf9af6-71e8-4722-b80f-cade9d5b795a", "text": "I love it! It smells amazing and adds beautiful color tint 💜", "image_url": "https://images-na.ssl-images-amazon.com/images/I/619nOJIAVnL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "c7aa15f4-97b1-42d7-8c17-3d2c83c27772", "text": "I love these but kinda scared to use the ones I just ordered since they came already open unsealed 🤔", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71Yo7gxg17L.jpg", "sentiment": "negative"}, {"review_id": "c92eaaa7-e969-4f21-ab4e-034eac4d22f9", "text": "really small", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71XW8Dr8jAL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "ce5b881b-2502-474a-b76d-e0bb1f0ba6ae", "text": "These chapsticks are great! They’re so smooth and buttery. Super hydrating and all the flavors I got taste great! The all natural ingredients and eco friendly packaging make these my new go-to lip balms.", "image_url": "https://m.media-amazon.com/images/I/A1wTCliM00L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "ca14f955-b553-4708-98fc-c983c9fd6d7c", "text": "Although the swatches are pretty colors, I was a little disappointed that the colors weren’t quite as advertised: not as nude, bold, or completely matte looking. Some have a slight crayon smell to them, but the color holds up well and lasts through eating and drinking without looking cakey or dry.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/7160grc2jXL.jpg", "sentiment": "positive"}, {"review_id": "b1c13735-0590-4f5c-8a4b-ee6785cb05d0", "text": "A lotion bar i have developed uses mango butter as one of its ingredients. i started out using shea butter, but the scent overpowered the scent from the essential oils i added so i switched to mango butter.<br /><br />it has no scent which is great. it comes in 1 or more blocks which makes it easy for me to cut off chunks for measuring. delivery was fast fast! this butter is consistent throughout my process. i will be using this company from now on. i am very satisfied!!!", "image_url": "https://m.media-amazon.com/images/I/91ZKoWAERGL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "a510e8aa-d227-4cc9-8a9b-59677920155a", "text": "We really liked these! Awesome for our mixed chicks glosses", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81TqQbRr72L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "01f37a09-ade4-4cfd-9dae-1f6e14c51831", "text": "Nothing like advertised. Color is a gross hot pink with a super thick consistency. They already gave me a refund. Throwing in the garbage. Don't waste your time or money", "image_url": "https://m.media-amazon.com/images/I/61ZXrOCaXVL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "007e132b-b1bc-4d2f-8be9-dcfef667d01d", "text": "I ordered 2 packs. 4 stars only because of minor scuffs and scratches and it's a little hard to get the stopper in. Overall they were still great to use. Once gloss is in you cant see the scuffs, still keeping in mind a label will be added to hide any that COULD possibly be seen. Most likely to order again.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71a7KKB8bUL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "af8835c1-f61c-4c1e-b276-e2eedfc79bbe", "text": "These temporary tattoos are okay. I was hoping they would be more individual pieces but it seems they work better if you cut shapes out of them.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/712ZvtKxibL.jpg", "sentiment": "neutral"}, {"review_id": "1be3041d-9765-40cb-b474-6eb42534d766", "text": "Just as advertised. These were great for my body butter samples. I am on my second order! Great product!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71Jwh3z3bIL.jpg", "sentiment": "positive"}, {"review_id": "2db4ba72-ce5d-49c6-8bf1-e2a9c076245f", "text": "[[VIDEOID:7a8514a6be97ed30d36cfda3c8224f19]] Had missing stoppers and tubes. Overall good product just annoyed that it was missing quite a few things.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81l2QUM++cL._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "3900a1ba-b51b-4181-8855-3606bfeab824", "text": "I love them very much", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71gX1sCRa9L.jpg", "sentiment": "positive"}, {"review_id": "50342c9e-76a6-4713-b5d1-4f59d12a1720", "text": "I like the bottle and the shape I dislike the applicator stick on the inside it’s not long enough to reach the gloss on the bottom", "image_url": "https://images-na.ssl-images-amazon.com/images/I/717oadLe5+L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "d02345b5-1384-4c02-a1ea-fbe9c86f1b2d", "text": "Perfect size travel toiletry bag. Good for any age. Purchased as a gift for a college student. Nice quality skincare & hair products in what appears to be a well-made sturdy canvas bag. The bag holds all The Basics Set products and then some. I bought the Marlowe Travel Soap Holder No-Leak Zipper Container separately. Which could be a nice added bonus for buying this set.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71j6pZjVGTL.jpg", "sentiment": "positive"}, {"review_id": "3a4ab7ed-c0fe-498e-86a8-883d3715deaa", "text": "These are the ones with the four sunscreens in them and they taste like sunscreens or bug spray not the ones with only the two sunscreens in them as stated  in your ad. The ones with only two sunscreens in them get 5 stars and these only get two because of the horrible taste.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71WD1+34NHL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "e702e9f1-ae20-410b-ac1f-b999d9bc2d82", "text": "This bundle is horrible you can't fill the pencil or this tube. The top want close and the cap automatically pops up cause of the air. I wasted my gloss trying to fill theses. Just oder the popsicles and candy containers by theirselfs.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/918Y0g47fzL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "702413cd-3679-4b6a-812c-9baab206f962", "text": "Received my shipment of jars today and was dismayed to see that they were individually wrapped in cellophane wrappers within two, one gallon ziplock bags.  The quality seemed ok but it means more work and more trash to have to unwrap each one.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61msA+UHUyL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "7e185571-2bb2-4414-b14c-ea5018fb1c2f", "text": "This is TERRIBLE!!<br />A WASTE OF MONEY THIS SIZE FOR THAT AMOUNT OF MONEY. I WILL NEVER BUY FROM THIS COMPAMY AGAIN..<br />THOUGHT THE SIZE WAS BIGGER  SO DISAPPOINTED 😞 😕", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71vCctu-hTL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "7a6150d4-5530-4dbb-8717-0df802f4173e", "text": "I bought these to use with boxes that are substantially shorter so they should have had good coverage. The problem is they more or less disappear under heat. They shrink yeah…to nothing. Packages end up looking like crap. Very disappointed.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/C1VCrlnJXdS._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "5b4e927f-e1db-4fa4-b7a5-ff6a5fd56365", "text": "Absolutely love, I’m very forgetful and misplace things, this product helps sooo much!!!  But the pouch to keep the gloss in does have a very strong chemical smell that left my gloss smelling the same way overall love it.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/C1E1tIQPUPS._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "f4a15b62-1a88-4362-96d7-4c13b6a71eda", "text": "This is one of the worst kits I have ever used with my daughter. I make lip balm from scratch for my small business but my husband bought this for our daughter out at the store since it was on clearance. For one my daughter didn’t want to hold the cup over boiling water the steam was bugging her hand and the water did not warm the wax enough to melt it. One cup to be used for all colors meant lots of in between clean up and the base with the tiny scoop was a pain to use. Would never recommend this product If I received it free I would throw it out instead of use it. That is how awful this kit is.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81z1bB9j-KL.jpg", "sentiment": "negative"}, {"review_id": "d4b0d338-054b-4357-8fdc-382e32a477ad", "text": "I love how cute these are!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/810g5C7TsZL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "d0deb3e2-8ad6-445e-8c81-1e2baa2bd2a5", "text": "I've bought this bulk once before and the first time everything was perfect and I had no issues with any of the chapsticks. However, the recent one I had just got I think lack the mint oil or something because they smell and taste TERRIBLE. Smell like dirty socks and the taste is just god awful. Although the price is decent I expected more of a better outcome. Also the first one I took out had a black spot in it. Just keep a look out guys as I ended up very disappointed this round.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/719zW8KUBtL.jpg", "sentiment": "negative"}, {"review_id": "49a0bdfe-ea57-4657-9670-7c4a72e8e05b", "text": "Received two items in same order. One was considerably shorter and the part to turn to push up lip balm was missing. One item functioned as it should, but the second is unusable due to faulty packaging.", "image_url": "https://m.media-amazon.com/images/I/71qwX7lVAqL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "2a473a2e-8fd4-48d4-ab04-015a3730eaf7", "text": "I don't usually write reviews, but this is a new one for me.  This is my first time ordering these products.  I opened box yesterday and found that both containers' lids were cracked and broken apart inside the bag.  Funny enough, the box had air cushions, but the shea butter was set to the side of the box. If someone was rough with the package with that particular side, then the brittle plastic lids could have been cracked through the cardboard. I wouldn't have mind, if I didn't find, upon closer inspection, that one of the bottles looked like it has been tampered with as the seal has been raised.  Granted it was kinda hot outside (high 80s) when it arrived, so there's a possibility that the seal eroded from the heat. Regardless, I'm not touching something where the seal has been lifted.  So I dunno.  I'll be sending them back tomorrow.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71RMkDjy-tL.jpg", "sentiment": "negative"}, {"review_id": "d6f7dda6-75a1-494d-94c1-be35ffdcbda7", "text": "I have bought several orders of these over the past few months for my lip gloss business and I love them! The wand holds the perfect amount of gloss and they look so nice and high quality. Customers love them too!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91bxWHfr9yL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "56f26a1b-9cc0-4564-8ca8-f85dd93f6658", "text": "if could give a 0 stars i would. this is bad. smells awful like rancid wax. and has weird chunks in it . and had no color. do not get this. it's a waste of money and doesn't seem safe to apply to lips.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71Kgc5EU8sL.jpg", "sentiment": "negative"}, {"review_id": "6f756a0a-2fe7-4393-a07f-2cab07f1c7d3", "text": "Items are so pretty I took a chance on them even after the reviews. Tubes were packaged terribly and I only have 19 tubes and 20 stoppers. Missing 1 tube would love that tube please.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/C1L7nplAkMS._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "03f791d1-1a59-4205-8d6b-38f72cb53a58", "text": "Perfect for lipgloss ❤️<br />Aim2bgolden use them<br />There perfect 👌", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71VAUSozUYL.jpg", "sentiment": "positive"}, {"review_id": "f535714c-4fb1-4679-b6df-d22bec7a7bee", "text": "Super cute, would definitely purchase again!! But I would like if they individually wrapped them!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81IfAEgSa3L.jpg", "sentiment": "positive"}, {"review_id": "831c393b-1b96-4717-84bd-411e0c7cdc04", "text": "Love them!!!! I wish I could buy them in bulk!! I made a signature gloss for our cbd line they’re super cute and very unique only con is you have to push all the way down in order to close the lids but other than that they are great!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61sHBADPqHL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "a7849bc4-09d0-41bd-93d6-d6f7038bb9f7", "text": "Great value for the money! All of them items were just as described and of great quality! I can’t wait to gift these to other women. Perfect for a girls’ night in!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/A1cUeCmn4uL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "59cd35eb-4fdd-47b8-984d-3fb3243a2f4b", "text": "This item is ridiculously tiny NOT worth the money", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81ufyTn6WAL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "c7635650-636f-463f-9c12-d50e40d0675f", "text": "i missed my return window but almost all of my lids cracked", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81YWxXfUpEL.jpg", "sentiment": "negative"}, {"review_id": "49a162a6-7d71-43f9-b7fe-5053f5e901bc", "text": "These are cute but tiny like this is most definitely a sample size", "image_url": "https://m.media-amazon.com/images/I/917Kq32b7cL._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "5ca83938-cdb5-4243-8c9c-9d10e88bd286", "text": "The stopper keeps getting stuck in the cap. How can I keep my stopper attached to the tube??", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71D5Z-nLpjL._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "1f4a079c-1cfa-402b-bb2c-b0a64eb8d30d", "text": "Product arrived opened. Trashed.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61SZNxWX+wL.jpg", "sentiment": "negative"}, {"review_id": "83e2c7e4-1fae-4330-a9bb-e89cb3417530", "text": "Color looks orange don’t stand up properly, very hard to work totally disappointed with this product", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71eVqfOk2CL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "d7f03949-47b7-40f2-9ffd-92d7393b850f", "text": "I love these lip balms. They are softening my dry lips and last a whole day even in the sunny and windy conditions. I was using these lip balms for couple of months and I can say that I am impressed. After this time, I do not have to use this product as often because how good it is. In contrast with the mainstream products, the products from Supremely Soft are handmade in USA from only natural ingredients and contain no harmful chemicals or dangerous preservatives. Product was shipped quickly and I was impressed with the professional packaging. I see that they are increasing their product line now. I will make sure to try new natural products from them as they become available.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/C1P+i4+D6yS._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "53206cbf-3e94-4a18-a170-708a30c23e07", "text": "I only received 8 and should have been 10 and every single one was dirty on the face like they had been dropped in the dirt.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71+tnXrRHQL.jpg", "sentiment": "negative"}, {"review_id": "9c1977e6-4337-4086-af96-53c5bb4b2a4f", "text": "I wish I could give this fewer stars. I should have heeded the advice of a large portion of the reviewers on this one. EVERY single tin is so damaged that they are unusable. Marking this seller as a NO go to in the future.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71dc8w8FZbL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "0dd5eb6e-1747-4314-9366-4013bf14807e", "text": "[[VIDEOID:54474058b3a13596376191d2de2043a3]] They are super cute & my customers loved them. I use these for my business ladiibugcreations", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71TIrU9f11L.jpg", "sentiment": "positive"}, {"review_id": "540cf41a-af06-45eb-86ae-acca876fc9ba", "text": "I love this! Its as described. I bought this after I paid 12.00 for one on the original store site. This is not a knockoff & its a great product. For some that doesn't know,all lips have different pigment. It may show up a different color on you as it does someone else. I ordered #16 mine shows up as described. .<br />I will be purchasing more :)", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71SKoM1UjIL.jpg", "sentiment": "positive"}, {"review_id": "948cc90e-2cbd-4221-972d-9f9d178b8345", "text": null, "image_url": "https://m.media-amazon.com/images/I/81Q2CcgH6tL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "2c14cdef-4565-4866-94d9-2df6ba3e1fd5", "text": "They look  cute but can’t decide if it leaves a greasy feeling or just really soft, they do not taste like fruit flavors at all more like plain Vaseline. I received 5 crying emojis 1 sad 3 happy and one sleepy emoji.  My three year said why would they send so many crying emojis for my birthday party they should send more happy ones and love ones. This is not good.  My friends are not going to like that”. My three year old gets it.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71FHaSVLO7L.jpg", "sentiment": "negative"}, {"review_id": "1783ceb8-eabe-4b50-861f-e3f5c775ab6d", "text": "i orderd this thinking it would be a dupe for the door lip oil. hell nah this is so small don’t get it", "image_url": "https://m.media-amazon.com/images/I/61XRhnGX4lL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "1b4402f8-f6c3-40ee-85e3-5e830bd3e45a", "text": "It is not worth it! CUSTOMERS BEWARE. it is so small, especially since it is so expensive. DO NOT BUY THIS. DO NOT WASTE YOUR MONEY. I was very disappointed with the outcome of this product as well. Also, they literally have cheaper lip gloss bases that are bigger, so do not waste your money!!!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61Gq+WkWODL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "31ac258f-bc24-4eed-986b-1d55a7dcb964", "text": "I love this product yes I had 2 pieces broken but u get 28 pieces and the price is perfect iv ordered 13 packs so far for my lip gloss products and I will keep ordering the sealer did not send droken pieces<br /><br />It’s the shipping company once it’s shipped the delivery company does not take care of the package they toss it throw it and drop it  the delivery company does not care<br /><br />So I don’t blame the seller for damaged product<br /><br />The product is amazing and it works for me thank u for making this product<br /><br />Keep it up I need u", "image_url": "https://m.media-amazon.com/images/I/51Vb0PRxZ8L._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "bc0b5832-6f0c-4a5c-a501-04e60c409c26", "text": "SOO TINY NOT A LIP OILS HORRIBLE DUPE", "image_url": "https://m.media-amazon.com/images/I/61hMjYSypVL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "ec4297f4-96e8-41cc-88d7-c12ab9e19acd", "text": "i like this lipstick set because it is easy to wear, fun colors, it is matte and waterproof as well. I received compliments when i wore it.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81js31C8TgL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "a9dc4b20-a7f7-4098-99a6-748dc55d23c8", "text": "What a ripoff.  These are selling at my local Walgreen's for 3 for $2 (less than $1 per tube!)", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71EXQnXIE4L.jpg", "sentiment": "negative"}, {"review_id": "951ff9b8-ea77-413c-88f0-1511d25e006f", "text": "What a ripoff.  These are selling at my local Walgreen's for 3 for $2 (less than $1 per tube!)", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71EXQnXIE4L.jpg", "sentiment": "negative"}, {"review_id": "59bc0133-1f15-416b-94a0-10dd0d188d9e", "text": "This size for the price is unacceptable especially when someone is running a business just like you.  Very disappointed and will not purchase again from this company.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71E4ADA2jcL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "1ded05ad-c741-4e61-9247-73b066cea802", "text": "After using the chapstick a couple times i noticed black dots at the bottom. I cut it open to see an ambulance of them. I dont put anything black on my lips so this has to be mold or something. Ive only had this chapstick for about a two to three months.  This was my first and last time using this product.", "image_url": "https://m.media-amazon.com/images/I/B1FEmPUmMPS._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "efd63de9-ec5f-4ce9-8587-54640fcb4551", "text": "Es hidratante y tiene buen sabor pero no fue lo que pedir", "image_url": "https://images-na.ssl-images-amazon.com/images/I/B1atw7rLyTS._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "e2953c73-a84d-497d-9dbb-1813f408f61c", "text": "No me agrado para nada el producto no es xomo se ve en la foto es súper pequeño pinta mal y es muy diferente a lo q están publicando como venta", "image_url": "https://m.media-amazon.com/images/I/71wazResVuL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "5c0cad29-f297-48ee-9b62-11da6268f723", "text": "These two are an amazing together and they smell amazing!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71MDWoRCrBL.jpg", "sentiment": "positive"}, {"review_id": "034c259e-e23f-4bda-9040-fde18599da3b", "text": "Super small!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71Or5D919kL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "91b2e26f-d11a-498f-a83d-f50f48b88e57", "text": "I was a bit sad when I saw that the chapstick holder for the white flowers wasn’t in there, instead there was an extra white sunflower one. Too bad because the white flower one is my favorite design.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71Y25rvEuUL._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "ff153d38-0574-4462-8f45-80abeeb732ff", "text": "This is the softest lip balm I've ever tried!  The fact that is has amazingly safe ingredients makes me feel very comfortable using it over and over.  It came in a carefully wrapped package, awesome presentation!  Highly recommended!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81O0YyAQoML._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "53b28407-53e9-4382-b281-d2aba65d4eeb", "text": "It's a good deal price for these but I realize now that may be because they're sent like this, with scratches all over the product. I was going to leave 1 star but I didnt because the product durability seems fine but clearly the product is damaged or even used.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/6165QOOW3HL.jpg", "sentiment": "negative"}, {"review_id": "9a6cce2b-2331-4712-bba9-c1beba98b7f0", "text": "Sealed with hair inside. Pretty disappointing:/", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61i10jFlXfL.jpg", "sentiment": "negative"}, {"review_id": "eb643ac3-2c28-4deb-a302-185520d7d0df", "text": null, "image_url": "https://images-na.ssl-images-amazon.com/images/I/61hK1ZnZxHL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "a327238d-e185-4109-a8b3-dea9d234fa33", "text": "Great product.. just like the picture but 5 were broken in the pack .", "image_url": "https://images-na.ssl-images-amazon.com/images/I/B1dSekzXVuS._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "237ccfb1-a2ce-4ce1-8ccf-7c63cc31887a", "text": "I ordered this lip balm because I received it on an Ipsy bag a few months back and I loved it. When I found it here I knew I had to have it so I ordered it. Arrived today perfectly. Thank you so much.", "image_url": "https://m.media-amazon.com/images/I/B1B1MIH7eKS._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "3361eaa4-97f0-4ea7-bed8-9372c5f1ccbe", "text": null, "image_url": "https://m.media-amazon.com/images/I/81miOOhTJCL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "5a1459ee-47be-4b83-b1a6-7abf6907c8cf", "text": "[[VIDEOID:a3c0d2a765289ca224d9f8bdf4dfd6f3]] UPDATE: I received a new batch and they all seem to connect fine. I haven’t used them yet but these do twist on like they’re supposed to.<br /><br />None of my caps would twist onto the bottom. I did not get the full quantity advertised and they all looked bent out of shape, almost as if they had melted or something. Maybe I just got a defected batch so hopefully the replacement is a lot better, I really love how they look. I’ll come back with an updated review.", "image_url": "https://m.media-amazon.com/images/I/81XgfwvKZmL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "b8ffa1b8-0143-49e5-bf4b-b9785b36c030", "text": "Update from last review. Received all 48, 6 were broken . Not to bad but of course preferably none broken. Need better shipping method", "image_url": "https://images-na.ssl-images-amazon.com/images/I/A1X7S5Xxz5L._SL1600_.jpg", "sentiment": "neutral"}, {"review_id": "7d8a3d69-a6d0-4da1-8c80-b957df19552f", "text": "I am loving my new dandy bee lip balm. It is refreshing and makes my lips feel great. I love how your order comes with a card from the owner, it’s a great personal touch. Also, the back of each lip balm lists the ingredients and I actually know what they all are. It is comforting to be able to know exactly what’s going on my skin! I like variety so it’s fun to try all the different types, but my personal favorite is the Mojito! I would definitely recommend!!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71V4RpgyFxL.jpg", "sentiment": "positive"}, {"review_id": "b0ace101-bcc3-4a0b-a413-acdae032516e", "text": "The size of my pinky. Looks nothing like the description. Not even a lip oil, just hot pink lipstick", "image_url": "https://m.media-amazon.com/images/I/716kfe8fycL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "f04d4b68-8695-4ddf-9f22-1ecdaf85d6b4", "text": "I ordered this specifically for the Champagne Pop as a stocking stuffer for my wife because she likes that one a lot. Instead, we received a pack of some other random flavors, neither of which were the ones listed on the product description.", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81ug1viqpjL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "b20bc578-1088-4117-a4c3-3beaf604e0c2", "text": "waste of money. it leaky every where!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/610hqxM26kL.jpg", "sentiment": "negative"}, {"review_id": "cb7addb3-2277-49be-88ae-5d414a70b4b2", "text": "Smells great and feels silky smooth when applying to lips. I use this every night and also now that it is cold I leave the house with it  on!!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/718m0eUfsuL._SL1600_.jpg", "sentiment": "positive"}, {"review_id": "a93f4c9e-af88-4b66-8ede-2bd6d5e08cf3", "text": "I bought this product because it was a good deal. I applied it for to days and already felt my lips on fire and burning but i told myself it could be because it was healing my lips or anything like that. On the 3rd day, I started to notice tiny dots on my lips that I’ve never had (see picture). I paniced and thought it was a serious disease. Stopped using them and used another product and my lips went back normal. And again used it to make sure it was the cause of those little dots and again I had them! Never purchase this product. It contains plenty of chemicals that’re harmful to our systems. Bad choice 👎🏼👎🏼👎🏼", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61Ix1JXXeXL.jpg", "sentiment": "negative"}, {"review_id": "ac4934a3-c093-4e69-b6f8-3e54f97fb349", "text": "THis product isn’t worth it . Doesn’t describe that the product is super small! Follow me on IG @chrissyrackss", "image_url": "https://images-na.ssl-images-amazon.com/images/I/8182pMQIuTL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "516272fa-1793-45fa-906b-8084f44e3662", "text": "Seems like a good base but they send the bags literally almost empty , don’t bother it’s a waste and you’re better off researching one worth your money like the llama brand that comes with five times as much for two dollars more", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71BxzIfwtSL._SL1600_.jpg", "sentiment": "negative"}, {"review_id": "81c774bd-5cc1-4c6e-9ea7-9454747b60ce", "text": "When I got this product in the mail I was surprised at how small it was (about 4cm in diameter). However this product has wowed me after using it for the first time. The color is super pigmented and when applied to the lips and cheeks it blends in flawlessly and feels like you have nothing on. There is no sticky or oily finish and it smells amazing! It does have a tingly minty feeling due to the peppermint extract but I enjoy that so it's not problematic for me. I would recommend this to anyone looking for a versatile organic beauty product!", "image_url": "https://images-na.ssl-images-amazon.com/images/I/717fRqf+ZRL.jpg", "sentiment": "positive"}]